{
  "architectures": [
    "DeepseekV4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 1,
  "expert_dtype": "fp4",
  "hc_eps": 1e-06,
  "hc_mult": 4,
  "hc_sinkhorn_iters": 20,
  "head_dim": 512,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "index_head_dim": 128,
  "index_n_heads": 64,
  "index_topk": 512,
  "initializer_range": 0.02,
  "max_position_embeddings": 1048576,
  "model_type": "deepseek_v4",
  "moe_intermediate_size": 2048,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 43,
  "num_hash_layers": 3,
  "num_key_value_heads": 1,
  "num_nextn_predict_layers": 1,
  "o_groups": 8,
  "o_lora_rank": 1024,
  "q_lora_rank": 1024,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 16,
    "original_max_position_embeddings": 65536,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 1.5,
  "scoring_func": "sqrtsoftplus",
  "sliding_window": 128,
  "swiglu_limit": 10.0,
  "tie_word_embeddings": false,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.1",
  "use_cache": true,
  "vocab_size": 129280,
  "compress_rope_theta": 160000,
  "compress_ratios": [
    0,
    0,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    0
  ],
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "targets": [
          "Linear"
        ],
        "input_activations": {
          "actorder": null,
          "block_structure": null,
          "dynamic": true,
          "group_size": null,
          "num_bits": 8,
          "observer": "memoryless",
          "observer_kwargs": {},
          "strategy": "token",
          "symmetric": true,
          "type": "float"
        },
        "activation_use_clip": false,
        "output_activations": null,
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": null,
          "num_bits": 8,
          "observer": "minmax",
          "observer_kwargs": {},
          "strategy": "channel",
          "symmetric": true,
          "type": "float"
        }
      },
      "group_1": {
        "targets": [
          "MoEGMM"
        ],
        "input_activations": {
          "actorder": null,
          "block_structure": null,
          "dynamic": true,
          "group_size": null,
          "num_bits": 8,
          "observer": "memoryless",
          "observer_kwargs": {},
          "strategy": "token",
          "symmetric": true,
          "type": "float"
        },
        "activation_use_clip": false,
        "output_activations": null,
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": null,
          "num_bits": 4,
          "observer": "minmax",
          "observer_kwargs": {},
          "strategy": "channel",
          "symmetric": true,
          "type": "float"
        }
      }
    },
    "format": "float-quantized",
    "global_compression_ratio": 1,
    "ignore": [
      "layers.2.attn.indexer.weights_proj",
      "layers.2.attn.indexer.compressor.wgate",
      "layers.2.attn.indexer.compressor.wkv",
      "layers.2.attn.compressor.wgate",
      "layers.2.attn.compressor.wkv",
      "layers.3.attn.compressor.wgate",
      "layers.3.attn.compressor.wkv",
      "layers.4.attn.indexer.weights_proj",
      "layers.4.attn.indexer.compressor.wgate",
      "layers.4.attn.indexer.compressor.wkv",
      "layers.4.attn.compressor.wgate",
      "layers.4.attn.compressor.wkv",
      "layers.5.attn.compressor.wgate",
      "layers.5.attn.compressor.wkv",
      "layers.6.attn.indexer.weights_proj",
      "layers.6.attn.indexer.compressor.wgate",
      "layers.6.attn.indexer.compressor.wkv",
      "layers.6.attn.compressor.wgate",
      "layers.6.attn.compressor.wkv",
      "layers.7.attn.compressor.wgate",
      "layers.7.attn.compressor.wkv",
      "layers.8.attn.indexer.weights_proj",
      "layers.8.attn.indexer.compressor.wgate",
      "layers.8.attn.indexer.compressor.wkv",
      "layers.8.attn.compressor.wgate",
      "layers.8.attn.compressor.wkv",
      "layers.9.attn.compressor.wgate",
      "layers.9.attn.compressor.wkv",
      "layers.10.attn.indexer.weights_proj",
      "layers.10.attn.indexer.compressor.wgate",
      "layers.10.attn.indexer.compressor.wkv",
      "layers.10.attn.compressor.wgate",
      "layers.10.attn.compressor.wkv",
      "layers.11.attn.compressor.wgate",
      "layers.11.attn.compressor.wkv",
      "layers.12.attn.indexer.weights_proj",
      "layers.12.attn.indexer.compressor.wgate",
      "layers.12.attn.indexer.compressor.wkv",
      "layers.12.attn.compressor.wgate",
      "layers.12.attn.compressor.wkv",
      "layers.13.attn.compressor.wgate",
      "layers.13.attn.compressor.wkv",
      "layers.14.attn.indexer.weights_proj",
      "layers.14.attn.indexer.compressor.wgate",
      "layers.14.attn.indexer.compressor.wkv",
      "layers.14.attn.compressor.wgate",
      "layers.14.attn.compressor.wkv",
      "layers.15.attn.compressor.wgate",
      "layers.15.attn.compressor.wkv",
      "layers.16.attn.indexer.weights_proj",
      "layers.16.attn.indexer.compressor.wgate",
      "layers.16.attn.indexer.compressor.wkv",
      "layers.16.attn.compressor.wgate",
      "layers.16.attn.compressor.wkv",
      "layers.17.attn.compressor.wgate",
      "layers.17.attn.compressor.wkv",
      "layers.18.attn.indexer.weights_proj",
      "layers.18.attn.indexer.compressor.wgate",
      "layers.18.attn.indexer.compressor.wkv",
      "layers.18.attn.compressor.wgate",
      "layers.18.attn.compressor.wkv",
      "layers.19.attn.compressor.wgate",
      "layers.19.attn.compressor.wkv",
      "layers.20.attn.indexer.weights_proj",
      "layers.20.attn.indexer.compressor.wgate",
      "layers.20.attn.indexer.compressor.wkv",
      "layers.20.attn.compressor.wgate",
      "layers.20.attn.compressor.wkv",
      "layers.21.attn.compressor.wgate",
      "layers.21.attn.compressor.wkv",
      "layers.22.attn.indexer.weights_proj",
      "layers.22.attn.indexer.compressor.wgate",
      "layers.22.attn.indexer.compressor.wkv",
      "layers.22.attn.compressor.wgate",
      "layers.22.attn.compressor.wkv",
      "layers.23.attn.compressor.wgate",
      "layers.23.attn.compressor.wkv",
      "layers.24.attn.indexer.weights_proj",
      "layers.24.attn.indexer.compressor.wgate",
      "layers.24.attn.indexer.compressor.wkv",
      "layers.24.attn.compressor.wgate",
      "layers.24.attn.compressor.wkv",
      "layers.25.attn.compressor.wgate",
      "layers.25.attn.compressor.wkv",
      "layers.26.attn.indexer.weights_proj",
      "layers.26.attn.indexer.compressor.wgate",
      "layers.26.attn.indexer.compressor.wkv",
      "layers.26.attn.compressor.wgate",
      "layers.26.attn.compressor.wkv",
      "layers.27.attn.compressor.wgate",
      "layers.27.attn.compressor.wkv",
      "layers.28.attn.indexer.weights_proj",
      "layers.28.attn.indexer.compressor.wgate",
      "layers.28.attn.indexer.compressor.wkv",
      "layers.28.attn.compressor.wgate",
      "layers.28.attn.compressor.wkv",
      "layers.29.attn.compressor.wgate",
      "layers.29.attn.compressor.wkv",
      "layers.30.attn.indexer.weights_proj",
      "layers.30.attn.indexer.compressor.wgate",
      "layers.30.attn.indexer.compressor.wkv",
      "layers.30.attn.compressor.wgate",
      "layers.30.attn.compressor.wkv",
      "layers.31.attn.compressor.wgate",
      "layers.31.attn.compressor.wkv",
      "layers.32.attn.indexer.weights_proj",
      "layers.32.attn.indexer.compressor.wgate",
      "layers.32.attn.indexer.compressor.wkv",
      "layers.32.attn.compressor.wgate",
      "layers.32.attn.compressor.wkv",
      "layers.33.attn.compressor.wgate",
      "layers.33.attn.compressor.wkv",
      "layers.34.attn.indexer.weights_proj",
      "layers.34.attn.indexer.compressor.wgate",
      "layers.34.attn.indexer.compressor.wkv",
      "layers.34.attn.compressor.wgate",
      "layers.34.attn.compressor.wkv",
      "layers.35.attn.compressor.wgate",
      "layers.35.attn.compressor.wkv",
      "layers.36.attn.indexer.weights_proj",
      "layers.36.attn.indexer.compressor.wgate",
      "layers.36.attn.indexer.compressor.wkv",
      "layers.36.attn.compressor.wgate",
      "layers.36.attn.compressor.wkv",
      "layers.37.attn.compressor.wgate",
      "layers.37.attn.compressor.wkv",
      "layers.38.attn.indexer.weights_proj",
      "layers.38.attn.indexer.compressor.wgate",
      "layers.38.attn.indexer.compressor.wkv",
      "layers.38.attn.compressor.wgate",
      "layers.38.attn.compressor.wkv",
      "layers.39.attn.compressor.wgate",
      "layers.39.attn.compressor.wkv",
      "layers.40.attn.indexer.weights_proj",
      "layers.40.attn.indexer.compressor.wgate",
      "layers.40.attn.indexer.compressor.wkv",
      "layers.40.attn.compressor.wgate",
      "layers.40.attn.compressor.wkv",
      "layers.41.attn.compressor.wgate",
      "layers.41.attn.compressor.wkv",
      "layers.42.attn.indexer.weights_proj",
      "layers.42.attn.indexer.compressor.wgate",
      "layers.42.attn.indexer.compressor.wkv",
      "layers.42.attn.compressor.wgate",
      "layers.42.attn.compressor.wkv",
      "mtp.0.head",
      "head"
    ],
    "quant_method": "compressed-tensors",
    "quantization_status": "compressed",
    "weight_block_size": [
      128,
      128
    ],
    "kv_cache_scheme": {
      "num_bits": 8,
      "type": "float"
    },
    "li_cache_scheme": {
      "type": "float",
      "num_bits": 8
    }
  }
}